### staging environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 0s
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=ffab38df-cddf-433f-859a-6cfa161a5ceb-4b7cd4a0-3d17-4a05-83e9-74b124c3214d-6b97a0e3-d398-4bbf-b2fc-6ccfe1748d3e]
data.azurerm_container_registry.main: Reading...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjdjZDRhMC0zZDE3LTRhMDUtODNlOS03NGIxMjRjMzIxNGQ7b2JqZWN0SWQ9NmI5N2EwZTMtZDM5OC00YmJmLWIyZmMtNmNjZmUxNzQ4ZDNlO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
azurerm_user_assigned_identity.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-stage-westeurope-001]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-stage-001]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Insights/components/appi-tshort-stage-westeurope-001]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.OperationalInsights/workspaces/log-tshort-stage-westeurope-001]
data.azurerm_container_registry.main: Read complete after 1s [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]
azurerm_role_assignment.api_acr_pull: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001/providers/Microsoft.Authorization/roleAssignments/b63c4862-db8b-f2cf-44c7-d568ce41984b]
azuread_group.sql_server_admins: Refreshing state... [id=/groups/d93c212f-ab51-44af-8cf8-0ab0f4aa5316]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-stage-westeurope-001]
time_sleep.group_provisioning: Refreshing state... [id=2025-01-05T02:18:17Z]
azurerm_mssql_server.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Sql/servers/sql-tshort-stage-westeurope-001]
cloudflare_dns_record.primary: Refreshing state... [id=4f70db14b86b939153a7df9ae5d6b58e]
time_sleep.wait_for_dns_record: Refreshing state... [id=2025-01-05T03:31:57Z]
azurerm_static_web_app_custom_domain.primary: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-stage-001/customDomains/staging.admin.tshort.me]
azurerm_mssql_firewall_rule.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Sql/servers/sql-tshort-stage-westeurope-001/firewallRules/AllowAzureServices]
azurerm_mssql_database.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.Sql/servers/sql-tshort-stage-westeurope-001/databases/sqldb-tshort]
azurerm_container_app.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001]
cloudflare_dns_record.api: Refreshing state... [id=7305d7ea2fcc322e796a9a57b812d181]
cloudflare_dns_record.asuid_api: Refreshing state... [id=c3db2340e04caaa5426c7b876eb01345]
time_sleep.api_custom_domain_records: Refreshing state... [id=2025-01-05T03:32:20Z]
azurerm_container_app_custom_domain.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001/customDomainName/staging.tshort.me]
azapi_resource_action.destroy_custom_domain_binding: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001]
azapi_resource.managed_certificate: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-stage-westeurope-001/managedCertificates/aca-tshort-api-stage-001]
azapi_resource_action.apply_custom_domain_binding: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.api will be updated in-place
  ~ resource "azurerm_container_app" "api" {
        id                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-stage-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-stage-001"
        name                          = "aca-tshort-api-stage-001"
        tags                          = {
            "environment" = "Staging"
            "managed-by"  = "Terraform"
            "project"     = "TShort"
        }
        # (10 unchanged attributes hidden)

      ~ template {
            # (4 unchanged attributes hidden)

          ~ container {
              ~ image             = "crtshortwesteurope001.azurecr.io/tshort-api:b88ac26cb033710bd62c393beae3fc596599303a" -> "crtshortwesteurope001.azurecr.io/placeholder"
                name              = "tshort-api"
                # (5 unchanged attributes hidden)

                # (3 unchanged blocks hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # cloudflare_dns_record.api will be updated in-place
  ~ resource "cloudflare_dns_record" "api" {
      ~ comment_modified_on = "2025-01-03T17:00:16Z" -> (known after apply)
      ~ created_on          = "2025-01-03T17:00:16Z" -> (known after apply)
        id                  = "7305d7ea2fcc322e796a9a57b812d181"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-04T11:11:48Z" -> (known after apply)
      ~ name                = "staging.tshort.me" -> "staging"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.asuid_api will be updated in-place
  ~ resource "cloudflare_dns_record" "asuid_api" {
      ~ comment_modified_on = "2025-01-03T17:00:15Z" -> (known after apply)
      ~ created_on          = "2025-01-03T17:00:15Z" -> (known after apply)
        id                  = "c3db2340e04caaa5426c7b876eb01345"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-01-03T17:00:15Z" -> (known after apply)
      ~ name                = "asuid.staging.tshort.me" -> "asuid.staging"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.primary will be updated in-place
  ~ resource "cloudflare_dns_record" "primary" {
      ~ comment_modified_on = "2025-01-02T23:39:06Z" -> (known after apply)
      ~ created_on          = "2025-01-02T23:39:06Z" -> (known after apply)
        id                  = "4f70db14b86b939153a7df9ae5d6b58e"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-06-04T11:11:26Z" -> (known after apply)
      ~ name                = "staging.admin.tshort.me" -> "staging.admin"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>